xiangjianhe/MonitorPro/code/Project/Header/TPV/PRJ_L_E2224_AD_INL_M215HNE_L30.h
//==================================================================
// Definitions of OOR Dclk Auto Adjust
//==================================================================
#define OOR_DCLK_CHECK                                  		_ON

//==================================================================
// Definitions of _VGA_CHROMA_PATTERN12_SUPPORT
//==================================================================
#define _VGA_CHROMA_PATTERN12_SUPPORT                           _ON

//==================================================================
// COLOR TEMP DEFAULT DATA
// Definitions Colortemp RGB value for each project
//==================================================================
#define _CT7200_LenovoPrj_RED                                   111  // 118
#define _CT7200_LenovoPrj_GREEN                                 114
#define _CT7200_LenovoPrj_BLUE                                  117  // 127

#define _CTSRGB_LenovoPrj_RED                                   114
#define _CTSRGB_LenovoPrj_GREEN                                 114  // 118
#define _CTSRGB_LenovoPrj_BLUE                                  114  // 126

#define _CT6500_LenovoPrj_RED                                   114
#define _CT6500_LenovoPrj_GREEN                                 114
#define _CT6500_LenovoPrj_BLUE                                  114

#define _CT9300_LenovoPrj_RED                                   104  // 105
#define _CT9300_LenovoPrj_GREEN                                 111  // 110
#define _CT9300_LenovoPrj_BLUE                                  128  // 127

#define _CTUSER_LenovoPrj_RED                                   128
#define _CTUSER_LenovoPrj_GREEN                                 128
#define _CTUSER_LenovoPrj_BLUE                                  128

//==================================================================
// Fine tuning OSD H position by pixel
//==================================================================
#define _OSD_POSITION_FONT_A_H_DELAY_                           1

//==================================================================
// Panel VCOM Function
//==================================================================
#define _PANEL_VCOM_ADJUST_FUNCTION						        _OFF

//-------------------------------------------------
//Definitions for panel backlight PWM ferq.
//-------------------------------------------------
#define _PWMFREQIVF                                             0
#define _PWMFREQ20K                                             1
#define _PWMFREQ22K												2

#define _BACKLIGHT_PWM_FREQ_SELECT                              _PWMFREQIVF//_PWMFREQ22K


#if(_OSD_TYPE == _LENOVO_2014_OSD)//Robert Wang 20141103
//-------------------------------------------------
//define for lenovo the keypad are aligned with the OSD ICON
//-------------------------------------------------
#define _NAVIGATE_ICON_POSITION_CONTROL							_ON

#define _ICON_BLANK1_PIXEL                                      20
#define _ICON_BLANK2_PIXEL                                      10
#define _ICON_BLANK3_PIXEL                                      10
#define _ICON_BLANK4_PIXEL                                      10
#define _ICON_BLANK5_PIXEL                                      26

#define _NAVIGATE_ICON_EXIT_COL_POSITION                        3
#define _NAVIGATE_ICON_LEFT_COL_POSITION                        10
#define _NAVIGATE_ICON_RIGHT_COL_POSITION                       17
#define _NAVIGATE_ICON_ENTER_COL_POSITION                       24
#define _NAVIGATE_ICON_POWER_COL_POSITION                       30
#define _AFTER_NAVIGATE_ICON_POWER_COL_POSITION                 35 

#define _TEXT_BLANK1_PIXEL                                      20
#define _TEXT_BLANK2_PIXEL                                      10
#define _NAVIGATE_TEXT_EXIT_COL_POSITION                        1
#define _NAVIGATE_TEXT_ENTER_COL_POSITION                       24
#define _AFTER_NAVIGATE_TEXT_ENTER_COL_POSITION                 32

//-------------------------------------------------
//define Audio
//-------------------------------------------------
#define _AUDIO_ADJUST_FUNCTION_SUPPORT				            _OFF
#define _AUDIO_EXTERNAL_AMP_SUPPORT								_OFF
#define _ANALOG_VOLUME_MUTE										0x0000
#endif

//==================================================================
// Auot Power Down Function
//==================================================================
#define _AUTO_POWER_DOWN                                        _ON
#define _AUTO_POWER_DOWN_DEF									_OFF

#if( ((_USER_DCR_FUNCTION == _ON) && (_DCR_PANEL_ON_OFF == _ON)) || ( _AUTO_POWER_DOWN ==_ON) )
#define _INSTANT_TIMER_EVENT_1                                  _ON
#else
#define _INSTANT_TIMER_EVENT_1                                  _OFF
#endif

//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
// Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
                                                
#endif // End of #if(_PROJECT == _PRJ_L_T2324P_AHP_LG_LM230WF3_SLN1)
